eureka-client-webservice/src/main/resources/schemas/Service.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="Service" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://tempuri.org/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsdl:types><xsd:schema targetNamespace="http://tempuri.org/Imports"><xsd:import schemaLocation="http://10.181.3.130:8088/Service.svc?xsd=xsd0" namespace="http://tempuri.org/"/><xsd:import schemaLocation="http://10.181.3.130:8088/Service.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="http://10.181.3.130:8088/Service.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/WcfService"/></xsd:schema></wsdl:types><wsdl:message name="IService_UserAuthentication_InputMessage"><wsdl:part name="parameters" element="tns:UserAuthentication"/></wsdl:message><wsdl:message name="IService_UserAuthentication_OutputMessage"><wsdl:part name="parameters" element="tns:UserAuthenticationResponse"/></wsdl:message><wsdl:message name="IService_CustomerAuthentication_InputMessage"><wsdl:part name="parameters" element="tns:CustomerAuthentication"/></wsdl:message><wsdl:message name="IService_CustomerAuthentication_OutputMessage"><wsdl:part name="parameters" element="tns:CustomerAuthenticationResponse"/></wsdl:message><wsdl:portType name="IService"><wsdl:operation name="UserAuthentication"><wsdl:input wsaw:Action="http://tempuri.org/IService/UserAuthentication" message="tns:IService_UserAuthentication_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService/UserAuthenticationResponse" message="tns:IService_UserAuthentication_OutputMessage"/></wsdl:operation><wsdl:operation name="CustomerAuthentication"><wsdl:input wsaw:Action="http://tempuri.org/IService/CustomerAuthentication" message="tns:IService_CustomerAuthentication_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService/CustomerAuthenticationResponse" message="tns:IService_CustomerAuthentication_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IService" type="tns:IService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="UserAuthentication"><soap:operation soapAction="http://tempuri.org/IService/UserAuthentication" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CustomerAuthentication"><soap:operation soapAction="http://tempuri.org/IService/CustomerAuthentication" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Service"><wsdl:port name="BasicHttpBinding_IService" binding="tns:BasicHttpBinding_IService"><soap:address location="http://10.181.3.130:8088/Service.svc"/></wsdl:port></wsdl:service></wsdl:definitions>