eureka-client-webservice/src/main/resources/schemas/客户验证.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>                                                                                        
   <soapenv:Body>                                                                                           
      <tem:CustomerAuthentication>                                                                          
         <tem:carNo></tem:carNo>                                                                            
         <tem:vin></tem:vin>                                                                                
         <tem:engineNo></tem:engineNo>                                                                      
      </tem:CustomerAuthentication>                                                                         
   </soapenv:Body>                                                                                          
</soapenv:Envelope>                                                                                         