eureka-client-webservice/src/main/resources/schemas/车主验证.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>                                                                                        
   <soapenv:Body>                                                                                           
      <tem:UserAuthentication>                                                                              
         <tem:userName></tem:userName>                                                                      
         <tem:userTel></tem:userTel>                                                                        
      </tem:UserAuthentication>                                                                             
   </soapenv:Body>                                                                                          
</soapenv:Envelope>                                                                                         